In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [13]:
#Costruct thw new feature from the old feature.
#Also split the feature.
#There is no any process. we think and create the process.

#Feaurer splitting
#Mean one single cell have more then  limit values.

In [37]:
df=sns.load_dataset("titanic")
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [39]:
df=df[['pclass','age', 'sibsp', 'parch','survived']]

In [40]:
df.head(4)

   pclass   age  sibsp  parch  survived
0       3  22.0      1      0         0
1       1  38.0      1      0         1
2       3  26.0      0      0         1
3       1  35.0      1      0         1

In [41]:
df.isnull().sum()

pclass        0
age         177
sibsp         0
parch         0
survived      0
dtype: int64

In [42]:
df.dropna(inplace=True)

In [43]:
df.isnull().sum()

pclass      0
age         0
sibsp       0
parch       0
survived    0
dtype: int64

In [22]:
df.shape

(714, 5)

In [44]:
df["Family_size"]=df["sibsp"] + df["parch"] + 1

In [45]:
df.sample(5)

     pclass   age  sibsp  parch  survived  Family_size
604       1  35.0      0      0         1            1
145       2  19.0      1      1         0            3
40        3  40.0      1      0         0            2
127       3  24.0      0      0         1            1
865       2  42.0      0      0         1            1

In [46]:
df["Family_size"].value_counts()

Family_size
1    404
2    139
3     93
4     27
6     22
7     12
5     11
8      6
Name: count, dtype: int64

In [47]:
def checkFamilyMember(x):
    if x==1: #where 1 mean solo perosn travelling 
        return 0
    elif x>1 and x<=4: #that mean family is small
        return 1
    else:
        return 2

In [48]:
df["family_size"]=df["Family_size"].apply(checkFamilyMember)

In [49]:
df.head(5)

   pclass   age  sibsp  parch  survived  Family_size  family_size
0       3  22.0      1      0         0            2            1
1       1  38.0      1      0         1            2            1
2       3  26.0      0      0         1            1            0
3       1  35.0      1      0         1            2            1
4       3  35.0      0      0         0            1            0

In [34]:
df.columns

Index(['pclass', 'age', 'sibsp', 'parch', 'survived', 'Family_size',
       'family_size'],
      dtype='object')

In [50]:
df.drop(columns=['sibsp', 'parch','Family_size'],inplace=True)

In [51]:
df.head(5)

   pclass   age  survived  family_size
0       3  22.0         0            1
1       1  38.0         1            1
2       3  26.0         1            0
3       1  35.0         1            1
4       3  35.0         0            0

In [52]:
#feature splitting

In [57]:
cv=sns.load_dataset("titanic")

In [58]:
cv.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True